// 008_Operator.cpp : 이 파일에는 'main' 함수가 포함됩니다. 거기서 프로그램 실행이 시작되고 종료됩니다.
//

#include <iostream>

int main()
{
    int Left = 3;
    int Right = 5;
    int Result = 0;

    // 변수를 사용해서 특정한 결과를 리턴하는 것을 연산자라고 한다.
    // 이때 변수가 1개 필요하면 -> 단항 연산자
    // !Left;

    // 변수가 2개 필요하면 -> 이항 연산자
    // Left + Right;

    // 변수가 3개 필요하면 -> 삼항 연산자
    // Result = Right > 0 ? Right : Left

    // 연산자의 종류는 다음과 같다
    // 1. 산술 연산자
    // 2. 비교 연산자
    // 3. 관계 연산자
    // 4. 비트 연산자
    // 5. 복합 할당 연산자
    // 6. 멤버, 포인터 연산자
    // 7. 기타 연산자
    // 

}