// 036_OOPStart.cpp : 이 파일에는 'main' 함수가 포함됩니다. 거기서 프로그램 실행이 시작되고 종료됩니다.
//

#include <iostream>

int main()
{
    // C++ 은 멀티패러다임 언어 (절차지향 + 객체지향 + 템플릿메타 + 함수형)

    // 객체지향(OOP)
    // - 객체(Object)라는 개념만을 사용해서 코딩하는 것
    // - 객체지향에는 전역이라는 개념이 존재하면 안된다. - 모든건 개념안에 묶여있어야한다.
    // - 개념이 메모리화된 것을 객체라고 한다.
    //   몬스터 -> 개념
    //   이 몬스터를 Monster1 해서 한마리 만들었어 <- 객체

    //   비유하자면
    // - int -> 정수라고 하는 개념
    // - int Value = 0; <- 객체를 만든 것

    // 032_TextRpgStart.cpp 에는 몬스터(객체)가 없다. - 절차지향이다.
    // 객체지향의 기본은 private함에서 나온다.
}